app/views/browser/pub.html.erb

SELECT  "styles".* FROM "styles" WHERE "styles"."style_id" = $1  ORDER BY "styles"."id" ASC LIMIT 1  [["style_id", 59]]
---
      #@pub = Brewery.find(params[:id])
      @assocStyle = Style.where(:style_id => pb.style_id).first