app/views/browser/style.html.erb


    @thisBrewery = Brewery.where(:id => sb.brewery_id).first
---
SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = $1  ORDER BY "breweries"."id" ASC LIMIT 1  [["id", 59]]