app/views/browser/styles.html.erb

SELECT "beers".* FROM "beers" WHERE "beers"."style_id" = $1  [["style_id", 48]]
---
  @allstyles.each do |s|
    @allBeersForStyle = Beer.where(:style_id => s.style_id)

SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = $1  ORDER BY "breweries"."id" ASC LIMIT 1  [["id", 121]]
---
        <%
        #grab the associated brewery for this beer.
        @bfb = Brewery.where(:id => bfs.brewery_id).first