app/controllers/browser_controller.rb

SELECT "breweries".* FROM "breweries"  ORDER BY name ASC
---
    #pubs = Brewery.where(:province == pc).order("name ASC")
    #@pubs = Brewery.near([49.277577, -122.913970], 6)
    #Brewery.geocoded
    @pubs = Brewery.near([request.location.latitude, request.location.longitude], 6).order("name ASC")