app/controllers/browser_controller.rb

SELECT "beers".* FROM "beers"
SELECT  "styles".* FROM "styles" WHERE (name LIKE Z%)  ORDER BY "styles"."id" ASC LIMIT 1
SELECT "breweries".* FROM "breweries"
---
  def styles
    #separate beers into styles - a testing page for now.
    @allbeers = Beer.all
    @allstyles = Style.all.order("name ASC")

    @allbreweries = Brewery.all

INSERT INTO "styles" ("style_id", "name", "abvMin", "abvMax", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["style_id", 157], ["name", "Other Specialty Cider Or Perry"], ["abvMin", "5.0"], ["abvMax", "12.0"], ["created_at", "2016-07-31 02:30:54.631687"], ["updated_at", "2016-07-31 02:30:54.631687"]]
---
  def load(pc)
    #brewery_db = tryAll()#in theory we don't need this anymore -- nevermind it's needed for styles...should be fixed later

    #pc = request.location.province

    #if (pc == "")
    #  pc = "British Columbia"
    #end


    #this is where we read in the API data and store it in our database.
    #@styles = brewery_db.styles.all()

    ##We need to load styles only if we have none since we load all of them
    if Style.count == 0
      @styles = tryStyles()

      @styles.each do |s|
        @oppa = Style.new(style_id: s.id,
                          name: s.name.titleize,
                          description: s.description,
                          ibuMin: s.ibuMin,
                          ibuMax: s.ibuMax,
                          abvMin: s.abvMin,
                          abvMax: s.abvMax,
                          srmMin: s.srmMin,
                          srmMax: s.srmMax)
        @oppa.save!

SELECT  1 AS one FROM "breweries" WHERE "breweries"."brewery_id" = 'nDWlSG' LIMIT 1
---
    @pubs.each do |p|

      begin
        p.brewery.images.medium.blank?

INSERT INTO "breweries" ("brewery_id", "name", "latitude", "longitude", "gpsLocation", "address", "province", "locality", "description", "imgUrl", "website", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
                            loc: pc)
      end

      @brewery.save!

INSERT INTO "beers" ("beer_id", "name", "abv", "style_id", "brewery_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["beer_id", "NOnCZC"], ["name", "Red Berry Gulp"], ["abv", 5], ["style_id", 119], ["brewery_id", 5], ["created_at", "2016-07-31 02:30:56.603551"], ["updated_at", "2016-07-31 02:30:56.603551"]]
---
#     @beer = @brewery.beers.create
      unless @beers.nil?
        @beers.each do |b|
          @thisBeerRightHere = @brewery.beers.create(beer_id: b.id,
                                        name: b.name.titleize,
                                        ibu: b.ibu,
                                        abv: b.abv,
                                        style_id: b.styleId,
                                        srmId: b.srmId,
                                        loc: pc)

SELECT breweries.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((49.277577 - breweries.latitude) * PI() / 180 / 2), 2) + COS(49.277577 * PI() / 180) * COS(breweries.latitude * PI() / 180) * POWER(SIN((-122.91397 - breweries.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((breweries.longitude - -122.91397) / 57.2957795), ((breweries.latitude - 49.277577) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "breweries" WHERE (breweries.latitude BETWEEN 49.13284521688915 AND 49.42230878311085 AND breweries.longitude BETWEEN -123.1358168430955 AND -122.69212315690451 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((49.277577 - breweries.latitude) * PI() / 180 / 2), 2) + COS(49.277577 * PI() / 180) * COS(breweries.latitude * PI() / 180) * POWER(SIN((-122.91397 - breweries.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 10)  ORDER BY distance ASC, name ASC
SELECT COUNT(breweries.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((0.0 - breweries.latitude) * PI() / 180 / 2), 2) + COS(0.0 * PI() / 180) * COS(breweries.latitude * PI() / 180) * POWER(SIN((0.0 - breweries.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((breweries.longitude - 0.0) / 57.2957795), ((breweries.latitude - 0.0) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing) FROM "breweries" WHERE (breweries.latitude BETWEEN -0.13489824088780958 AND 0.13489824088780958 AND breweries.longitude BETWEEN -0.13489824088780958 AND 0.13489824088780958 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((0.0 - breweries.latitude) * PI() / 180 / 2), 2) + COS(0.0 * PI() / 180) * COS(breweries.latitude * PI() / 180) * POWER(SIN((0.0 - breweries.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 15)
---
    @maxPubDist = 12


    @pubs = Brewery.where("loc = ?", pc).order("name ASC")
    if @pubs.count == 0

SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = $1 LIMIT 1  [["id", 59]]
SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = $1  [["brewery_id", 59]]
---
  def pub
    #brewery_db = tryAll()
    #@pub = brewery_db.brewery(params[:id]).all
    @pub = Brewery.find(params[:id])
    @pubBeers = Beer.where(:brewery_id => @pub.id)

SELECT  "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT 1  [["id", 229]]
SELECT "beers".* FROM "beers" WHERE "beers"."style_id" = $1  [["style_id", 59]]
SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = $1  ORDER BY "breweries"."id" ASC LIMIT 1  [["id", 59]]
---
  def style

     @pc = ""

    @pc = request.location.province
    if (@pc == "")
      @pc = "British Columbia"
    end
    @styleBeers = []

    #@pub = brewery_db.brewery(params[:id]).all
    #find this particular style.
    @style = Style.find(params[:id])

    #A list of all beers associated with this style.
    @allStyleBeers = Beer.where(:style_id => @style.style_id)


    #filter down to user's location.

    #find breweries associated with these styles.
    @allStyleBeers.each do |asb|

      #find the associated Brewery so that we can determine it's location.
      @asbBreweries = Brewery.where(:id => asb.brewery_id)